claust/robot_3d/esp32-c5/led_flash/sdkconfig.defaults
# Build for the ESP32-C5 without needing `idf.py set-target` on a fresh checkout.
CONFIG_IDF_TARGET="esp32c5"

# XIAO ESP32-C5: the USB-C port is the chip's built-in USB Serial/JTAG,
# so send the console there instead of the UART pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# The XIAO ESP32-C5 carries 8 MB of flash (esptool flash-id confirms); the IDF default is 2 MB.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
